input_channel: 3
infrence_channels: 193

depth_multiple: 1.0
width_multiple: 1.0

custom_module_paths: ["models.layers"]

backbone:
  [
    [-1, 1, Input, [3, 32, True]], #0

    [-1, 1, Layer, [32, 2, 1, 3, False, False, True]], #layer1 1

    [-1, 1, Activation, [32]], #2
    [-1, 1, Layer, [32, 2, 2, 3, False, False, True]], #layer2 3

    [-1, 1, Activation, [64]], #4
    [-1, 1, Layer, [128, 2, 2, 3, False, False, False]], #layer3_1 5

    [3, 1, Activation, [64]], #6
    [-1, 1, Layer, [64, 2, 1, 3, False, True, False]], #layer3_1_ 7

    [-1, 1, Activation, [128]], #8
    [-1, 1, Downsample, [128, 3, 2, 1, False]], #down3 9
    [[5, -1], 1, Sum, [True, False]], #10

    [5, 1, Activation, [128]], #11
    [-1, 1, Compression, [64, 2]], #compression3 12
    [[7, -1], 1, Sum, [True, False]], #13

    [10, 1, Activation, [128]], #14
    [-1, 1, Layer, [256, 2, 2, 3, False, False, False]], #layer4 15

    [13, 1, Activation, [128]], #16
    [-1, 1, Layer, [64, 2, 1, 3, False, False, False]], #layer4_ 17

    [-1, 1, Activation, [128]], #18
    [-1, 1, Downsample, [128, 3, 2, 1, True]], #down4 19
    [[15, -1], 1, Sum, [True, False]], #20

    [15, 1, Activation, [256]], #21
    [-1, 1, Compression, [64, 4]], #compression4 22
    [[17, -1, 7], 1, Sum, [True, False]], #23

    [-1, 1, Activation, [64]], #24
    [-1, 1, Layer, [64, 1, 1, 3, True, False, False]], #layer5_ 25

    [20, 1, Activation, [128]], #26
    [-1, 1, Layer, [256, 1, 2, 3, True, False, False]], #layer5 27
    [-1, 1, DAPPM, [128, 128]], # 28

    [[25, -1, 17, 7], 1, Sum, [True, True]], #29
    [-1, 1, SegmentHead, [128, 3, 64, 8, True]], #30

    [12, 1, SegmentHead, [64, 3, 64, 8, False]], #31
    [[30, -1], 1, Covariance, [2]]
  ]