input_channel: 3
infrence_channels: 193

depth_multiple: 1.0
width_multiple: 1.0

custom_module_paths: [models.layers]

backbone: [[-1, 1, Input, [3, 64, true]],
                                   #0

[-1, 1, Layer, [64, 2, 1, 3, false, false, true]],
  
                                                       #layer1 1

[-1, 1, Activation, [64]],
                               #2
[-1, 1, Layer, [64, 2, 2, 3, false, false, true]],
                                                       #layer2 3

[-1, 1,
    Activation, [64]],
                               #4
[-1, 1, Layer, [256, 2, 2, 3, false, false, false]],
                                                         #layer3_1 5

[3, 1, Activation, [
      64]],
                              #6
[-1, 1, Layer, [128, 2, 1, 3, false, true, false]],
                                                        #layer3_1_ 7

[-1, 1, Activation, [
      128]],
                                #8
[-1, 1, Downsample, [256, 3, 2, 1, false]],
                                                #down3 9
[[5, -1], 1, Sum, [true, false]],
  
                                      #10

[5, 1, Activation, [256]],
                               #11
[-1, 1, Compression, [128, 2]],
                                    #compression3 12
[[7, -1], 1, Sum, [true,
      false]],
                                      #13

[10, 1, Activation, [256]],
                                #14
[-1, 1, Layer, [512, 2, 2, 3, false, false, false]],
  
                                                         #layer4 15

[13, 1, Activation, [128]],
                                #16
[-1, 1, Layer, [128, 2, 1, 3, false, false, false]],
  
                                                         #layer4_ 17

[-1, 1, Activation, [128]],
                                #18
[-1, 1, Downsample, [256, 3, 2, 1, true]],
                                               #down4 19
[[15, -1],
    1, Sum, [true, false]],
                                       #20

[15, 1, Activation, [512]],
                                #21
[-1, 1, Compression, [128, 4]],
  
                                    #compression4 22
[[17, -1], 1, Sum, [true, false]],
                                       #23

[-1, 1, Activation, [128]],
                                #24
[-1, 1, Layer, [128, 1,
      1, 3, true, false, false]],
                                                        #layer5_ 25

[20, 1, Activation, [128]],
                                #26
[-1, 1, Layer, [512, 1, 2,
      3, true, false, false]],
                                                        #layer5 27
[-1, 1, DAPPM, [256, 128, 8]],
                                   # 28

[[25, -1], 1, Sum, [true,
      true]],
                                      #29
[-1, 1, SegmentHead, [256, 3, 128, 8, true]],
                                                  #30

[12, 1, SegmentHead, [128, 3,
      128, 8, false]],
                                                   #31
[[30, -1], 1, Covariance, [2]]]
